app/views/users/show.html.erb

    <%= render 'follow_form' if logged_in? %>
    <% if @user.posts.any? %>
---
SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 1046959424], ["LIMIT", 1]]