app/controllers/posts_controller.rb

  def create
  	@post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This post really ties the room together"], ["user_id", 762146111], ["created_at", 2017-03-25 08:09:14 UTC], ["updated_at", 2017-03-25 08:09:14 UTC]]