app/controllers/static_pages_controller.rb

  def home
  	if logged_in?
      @post  = current_user.posts.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  "posts".* FROM "posts" WHERE (user_id IN (409608538,659682706) OR user_id = 762146111) ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (user_id IN (409608538,659682706) OR user_id = 762146111)