app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1046959424], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 762146111], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 762146111]]
---
  def show
    @user = User.find(params[:id])
    @posts = @user.posts.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 950961012], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "description" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["description", "Hello!"], ["updated_at", 2017-03-25 08:09:14 UTC], ["id", 762146111]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params_with_desc)